In [1]:
import numpy as np
import pandas as pd

In [2]:
# Handling Missing Data

In [3]:
string_data=pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0]=None

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
#Filtering Out Missing Data

In [10]:
from numpy import nan as NA

In [11]:
data=pd.Series([1,NA,3.5,NA,7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data=pd.DataFrame([[1,6.5,3],[1,NA,NA],[NA,NA,NA],[NA,6.5,3]])

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned=data.dropna()

In [18]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [19]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [21]:
data[4]=NA

In [23]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [24]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
df=pd.DataFrame(np.random.randn(7,3))

In [29]:
df.iloc[:4,1]=NA

In [31]:
df.iloc[:2,2]=NA

In [33]:
df.dropna()

          0         1         2
4 -0.794144  0.366316 -1.186937
5  0.126540  0.119373  1.656789
6  1.438464 -2.301596  1.297587

In [34]:
df.dropna(thresh=2)

          0         1         2
2  1.172179       NaN  1.239090
3  0.726542       NaN  0.268534
4 -0.794144  0.366316 -1.186937
5  0.126540  0.119373  1.656789
6  1.438464 -2.301596  1.297587

In [35]:
#Filling In Missing Data

In [36]:
df.fillna(0)

          0         1         2
0 -1.813425  0.000000  0.000000
1  1.348731  0.000000  0.000000
2  1.172179  0.000000  1.239090
3  0.726542  0.000000  0.268534
4 -0.794144  0.366316 -1.186937
5  0.126540  0.119373  1.656789
6  1.438464 -2.301596  1.297587

In [37]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -1.813425  0.500000  0.000000
1  1.348731  0.500000  0.000000
2  1.172179  0.500000  1.239090
3  0.726542  0.500000  0.268534
4 -0.794144  0.366316 -1.186937
5  0.126540  0.119373  1.656789
6  1.438464 -2.301596  1.297587

In [38]:
_=df.fillna(0,inplace=True)

In [39]:
df

          0         1         2
0 -1.813425  0.000000  0.000000
1  1.348731  0.000000  0.000000
2  1.172179  0.000000  1.239090
3  0.726542  0.000000  0.268534
4 -0.794144  0.366316 -1.186937
5  0.126540  0.119373  1.656789
6  1.438464 -2.301596  1.297587

In [40]:
df = pd.DataFrame(np.random.randn(6, 3))

In [42]:
df.iloc[2:,1]=NA

In [44]:
df.iloc[4:,2]=NA

In [45]:
df

          0         1         2
0  0.629612  0.222958 -1.821343
1 -0.890239 -0.743691 -0.754023
2  0.927695       NaN -0.299202
3 -1.827203       NaN  0.021213
4  1.418472       NaN       NaN
5  1.647562       NaN       NaN

In [46]:
df.fillna(method='ffill')

          0         1         2
0  0.629612  0.222958 -1.821343
1 -0.890239 -0.743691 -0.754023
2  0.927695 -0.743691 -0.299202
3 -1.827203 -0.743691  0.021213
4  1.418472 -0.743691  0.021213
5  1.647562 -0.743691  0.021213

In [47]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  0.629612  0.222958 -1.821343
1 -0.890239 -0.743691 -0.754023
2  0.927695 -0.743691 -0.299202
3 -1.827203 -0.743691  0.021213
4  1.418472       NaN  0.021213
5  1.647562       NaN  0.021213

In [48]:
 data = pd.Series([1., NA, 3.5, NA, 7])

In [49]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [50]:
#Data Transformation

In [51]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
            'k2': [1, 1, 2, 3, 3, 4, 4]})

In [52]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [53]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [54]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [55]:
data['v1']=range(7)

In [56]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [57]:
#Transforming Data Using a Function or Mapping

In [58]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
      'Pastrami', 'corned beef', 'Bacon',
       'pastrami', 'honey ham', 'nova lox'],
        'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [59]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [60]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

In [61]:
lowercased=data['food'].str.lower()

In [62]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [63]:
data['animal']=lowercased.map(meat_to_animal)

In [65]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [66]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [67]:
#Replacing Values

In [69]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [70]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [71]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [72]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [73]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [74]:
#Renaming Axis Indexes

In [75]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
        index=['Ohio', 'Colorado', 'New York'],
        columns=['one', 'two', 'three', 'four'])

In [76]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [88]:
transform=lambda x:x[:4].upper()

In [89]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [90]:
data.index=data.index.map(transform)

In [91]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [93]:
data.rename(columns=str.upper)

      ONE  TWO  THREE  FOUR
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [95]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [96]:
data.rename(index={'OHIO':'INDIANA'},
             columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [97]:
data.rename(index={'OHIO':'INDIANA'},inplace=True)

In [98]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [99]:
#Discretization and Binning

In [100]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [101]:
bins=[18,25,35,60,100]

In [102]:
cats=pd.cut(ages,bins)

In [103]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [105]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [106]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [107]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [109]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [110]:
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [111]:
data=np.random.randn(20)

In [112]:
data

array([-0.09940672, -0.23563948, -0.66508107, -0.15814352, -0.07455311,
       -2.10043896, -1.40873591,  1.10884436, -0.07321098, -0.69089437,
       -1.66410916, -0.28873461,  0.45741967, -0.07444487, -0.33916681,
       -1.69363382, -1.59392926,  1.58510876, -2.29413537, -0.31863545])

In [113]:
pd.cut(data,4,precision=2)

[(-0.35, 0.62], (-0.35, 0.62], (-1.32, -0.35], (-0.35, 0.62], (-0.35, 0.62], ..., (-2.3, -1.32], (-2.3, -1.32], (0.62, 1.59], (-2.3, -1.32], (-0.35, 0.62]]
Length: 20
Categories (4, interval[float64]): [(-2.3, -1.32] < (-1.32, -0.35] < (-0.35, 0.62] < (0.62, 1.59]]

In [114]:
data=np.random.rand(1000)

In [115]:
cats=pd.qcut(data,4)

In [116]:
cats

[(0.256, 0.487], (0.487, 0.743], (0.00296, 0.256], (0.487, 0.743], (0.487, 0.743], ..., (0.256, 0.487], (0.743, 0.999], (0.00296, 0.256], (0.743, 0.999], (0.487, 0.743]]
Length: 1000
Categories (4, interval[float64]): [(0.00296, 0.256] < (0.256, 0.487] < (0.487, 0.743] < (0.743, 0.999]]

In [117]:
pd.value_counts(cats)

(0.743, 0.999]      250
(0.487, 0.743]      250
(0.256, 0.487]      250
(0.00296, 0.256]    250
dtype: int64

In [119]:
pd.qcut(data,[0,0.1,0.5,0.9,1])

[(0.117, 0.487], (0.487, 0.89], (0.117, 0.487], (0.487, 0.89], (0.487, 0.89], ..., (0.117, 0.487], (0.487, 0.89], (0.00296, 0.117], (0.89, 0.999], (0.487, 0.89]]
Length: 1000
Categories (4, interval[float64]): [(0.00296, 0.117] < (0.117, 0.487] < (0.487, 0.89] < (0.89, 0.999]]

In [120]:
#Detecting and Filtering Outliers

In [121]:
data=pd.DataFrame(np.random.randn(1000,4))

In [123]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.004891    -0.025536     0.056985    -0.014869
std       1.002853     1.026830     0.999327     1.024413
min      -2.993979    -3.421071    -3.175999    -3.040101
25%      -0.675855    -0.746802    -0.586640    -0.698513
50%      -0.032141    -0.051424     0.041402    -0.009366
75%       0.683439     0.660593     0.724200     0.674023
max       3.445389     2.929202     4.269392     3.202704

In [124]:
col=data[2]

In [125]:
col[np.abs(col)>3]

12     4.269392
57     3.175346
139    3.358782
278   -3.009825
342   -3.175999
509    3.271359
Name: 2, dtype: float64

In [127]:
data[(np.abs(data)>3).any(1) ]

            0         1         2         3
12  -1.911635  0.917983  4.269392 -0.508187
57   0.075667  0.671281  3.175346  0.649008
76   3.445389 -0.451688  1.397264  0.511477
139  1.129253 -0.573609  3.358782  0.506950
167 -1.625442 -1.293948  0.292657 -3.040101
278  0.042605 -1.584568 -3.009825 -1.802334
342  0.014993  1.119905 -3.175999 -0.644882
416  0.252867 -3.094159 -1.635965 -0.086966
441 -0.855881 -3.421071  0.415293  0.453086
509 -0.696241 -1.206834  3.271359 -1.214899
679 -0.049427 -1.200504 -0.585702  3.202704

In [129]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0 -1.0
1 -1.0  1.0 -1.0  1.0
2  1.0 -1.0  1.0  1.0
3  1.0  1.0 -1.0 -1.0
4 -1.0  1.0 -1.0 -1.0

In [130]:
#Permutation and Random Sampling

In [131]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))